brew "btop"
brew "go"
brew "lazygit"
brew "lsd"
brew "neovim"
brew "node"
brew "python@3.11"
brew "ripgrep"
brew "zsh-vi-mode"
brew "zsh-autocomplete"
brew "zsh-completions"
brew "mas"

cask_args quarantine: false

cask "raycast", greedy: true
cask "orion", greedy: true
cask "iterm2", greedy: true
cask "linearmouse"
cask "topnotch"

tap "homebrew/cask-fonts"

cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-roboto-mono-nerd-font"

mas "Amphetamine", id: 937984704
mas "Xcode", id: 497799835
mas "Wireguard", id: 1451685025
